//12main8_2
// Самостоятельная работа
//Функции для массивов(ForEach,Filter,Map,Reduce)

// Создайте массив чисел.

// Используя метод forEach, выведите каждый элемент массива в консоль.

// Используя метод filter, создайте новый массив, содержащий только 
//четные числа из исходного массива, и выведите его в консоль.

// Используя метод map, создайте новый массив, в котором каждый элемент исходного 
//массива будет увеличен на 2, и выведите его в консоль.

// Используя метод reduce, вычислите сумму всех элементов исходного массива и выведите результат в консоль.