//12main3_2
// Самостоятельная работа

// Создайте три переменные: имя (тип данных строка), возраст (тип данных число) и студент (тип данных булевое значение).
// Присвойте переменным значения: ваше имя, ваш возраст и булево значение, указывающее, являетесь ли вы студентом.
// Используя команду, выведите значения переменных в консоль.


let Name = 'Михаил';
let age = 33;
let isStudent = false;

let info = '';
if (isStudent = true) {
    info = 'Да';
}
    else{
        info = 'Нет'
    }
console.log("Имя: "+ Name +" Возраст:" + age + " Студент: " + info)



// Создание переменных
var name2 = "Михаил";
var age2 = 25; // Замените на свой возраст
var student2 = true; // Измените на false, если вы не студент

// Вывод значений переменных в консоль
console.log("Имя:", name2);
console.log("Возраст:", age2);
console.log("Студент:", student2);